In [1]:
import numpy as np
import pandas as pd

In [2]:
DF = pd.read_csv('celebrity_deaths_2016.csv')

In [3]:
DF

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5,Unnamed: 6
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer,NaN,NaN
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer,NaN,NaN
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer,NaN,NaN
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke,NaN,NaN
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure,NaN,NaN
...,...,...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN,NaN,NaN
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN,NaN,NaN
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN,NaN,NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized,NaN,NaN
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN,NaN,NaN

In [4]:
DF.describe()

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5,Unnamed: 6
count,6543,6543,6516,6541,1535,1,1
unique,364,6526,138,5886,361,1,1
top,2016-11-28,Jack Riley,86,American politician.,cancer,neuroendocrine carcinoma.,
freq,43,2,236,33,248,1,1

In [5]:
DF.head(10)

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5,Unnamed: 6
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer,NaN,NaN
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer,NaN,NaN
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer,NaN,NaN
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke,NaN,NaN
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure,NaN,NaN
5,2016-01-01,Mike Oxley,71,"American politician, member of the United Stat...",lung cancer,NaN,NaN
6,2016-01-01,John Coleman Moore,92,American mathematician.,NaN,NaN,NaN
7,2016-01-01,Jacques Deny,99,French mathematician.,NaN,NaN,NaN
8,2016-01-01,Mark B,45,British hip-hop record producer.,NaN,NaN,NaN
9,2016-01-01,George Alexandru,58,Romanian theater and film actor.,NaN,NaN,NaN

In [7]:
DF.tail(3)

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5,Unnamed: 6
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN,NaN,NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized,NaN,NaN
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN,NaN,NaN

In [9]:
DF.sample(n=5)

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5,Unnamed: 6
5412,2016-10-24,Reinhard Hfner,64,"German footballer (Dynamo Dresden), Olympic ch...",NaN,NaN,NaN
6484,2016-12-26,Kalinik of Vratsa,85,"Bulgarian Orthodox prelate, Metropolitan of Vr...",NaN,NaN,NaN
3511,2016-07-03,Jimmy Frizzell,79,Scottish football player and manager.,NaN,NaN,NaN
1242,2016-03-02,Roger Hickman,61,"Australian yachtsman, winner of the Sydney to ...",brain cancer,NaN,NaN
6459,2016-12-25,Anton Gubankov,51,Notable Russian people killed in the crash of ...,NaN,NaN,NaN

In [10]:
DF['name']

0                      Tony Lane
1                 Gilbert Kaplan
2                    Brian Johns
3                Natasha Aguilar
4                   Fazu Aliyeva
                  ...
6538             Barbara Tarbuck
6539              Hans Tietmeyer
6540    Ratnasiri Wickremanayake
6541                Cara Rafaela
6542       Balasaheb Vikhe Patil
Name: name, Length: 6543, dtype: object

In [11]:
DF.keys

<bound method NDFrame.keys of      dateofdeath                      name age  \
0     2016-01-01                 Tony Lane  71
1     2016-01-01            Gilbert Kaplan  74
2     2016-01-01               Brian Johns  79
3     2016-01-01           Natasha Aguilar  45
4     2016-01-01              Fazu Aliyeva  83
...          ...                       ...  ..
6538  2016-12-27           Barbara Tarbuck  74
6539  2016-12-27            Hans Tietmeyer  85
6540  2016-12-27  Ratnasiri Wickremanayake  83
6541  2016-12-27              Cara Rafaela  23
6542  2016-12-27     Balasaheb Vikhe Patil  84

                                                    bio  \
0                 American art director (Rolling Stone)
1                    American conductor and businessman
2     Australian company director, managing director...
3     Costa Rican swimmer, silver and bronze medalis...
4                      Russian Avar poet and journalist
...                                                 ...
6538  American actress (General Hospital, Short Circ...
6539  German economist, President of Deutsche Bundes...
6540  Sri Lankan politician, Prime Minister (2000200...
6541  American racehorse (death announced on this date)
6542                                 Indian politician.

                    causeofdeath Unnamed: 5 Unnamed: 6
0                   brain cancer        NaN        NaN
1                         cancer        NaN        NaN
2                         cancer        NaN        NaN
3      complications of a stroke        NaN        NaN
4                  heart failure        NaN        NaN
...                          ...        ...        ...
6538                         NaN        NaN        NaN
6539                         NaN        NaN        NaN
6540                         NaN        NaN        NaN
6541                  euthanized        NaN        NaN
6542                         NaN        NaN        NaN

[6543 rows x 7 columns]>

In [12]:
DF['age'][5]

'71'

In [13]:
DF['name'][5]

'Mike Oxley'

In [15]:
DF.loc[8:12,'name':'bio']

                name age                                                bio
8             Mark B  45                   British hip-hop record producer.
9   George Alexandru  58                   Romanian theater and film actor.
10    Anil Salgaocar  75                   Indian executive and politician.
11       Homa Nategh  80                    Iranian educator and historian.
12        Ian Pieris  82  Sri Lankan cricketer (Cambridge University Cri...

In [17]:
DF.iloc[800:810, 0:2]

    dateofdeath                   name
800  2016-02-08         Violette Verdy
801  2016-02-08       Samuel Rappaport
802  2016-02-08            John Disley
803  2016-02-08  William Donald Stiehl
804  2016-02-08          Johnny Duncan
805  2016-02-08        Leon Vilaincour
806  2016-02-08            Viggo Rivad
807  2016-02-08           Norman Hudis
808  2016-02-08    August P. Mardesich
809  2016-02-08           Amelia Bence

In [18]:
DF.at[2, 'age']

'79'

In [19]:
DF.drop(columns = ['Unnamed: 5','Unnamed: 6'])

,dateofdeath,name,age,bio,causeofdeath
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure
...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN

In [20]:
DF.drop(columns = ['Unnamed: 5','Unnamed: 6'], inplace=True)
DF.columns

Index(['dateofdeath', 'name', 'age', 'bio', 'causeofdeath'], dtype='object')

In [21]:
DF

,dateofdeath,name,age,bio,causeofdeath
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure
...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN

In [22]:
DF.drop(columns = ['age'])

,dateofdeath,name,bio,causeofdeath
0,2016-01-01,Tony Lane,American art director (Rolling Stone),brain cancer
1,2016-01-01,Gilbert Kaplan,American conductor and businessman,cancer
2,2016-01-01,Brian Johns,"Australian company director, managing director...",cancer
3,2016-01-01,Natasha Aguilar,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke
4,2016-01-01,Fazu Aliyeva,Russian Avar poet and journalist,heart failure
...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,"American actress (General Hospital, Short Circ...",NaN
6539,2016-12-27,Hans Tietmeyer,"German economist, President of Deutsche Bundes...",NaN
6540,2016-12-27,Ratnasiri Wickremanayake,"Sri Lankan politician, Prime Minister (2000200...",NaN
6541,2016-12-27,Cara Rafaela,American racehorse (death announced on this date),euthanized
6542,2016-12-27,Balasaheb Vikhe Patil,Indian politician.,NaN

In [23]:
DF.drop(index = [0,1])

,dateofdeath,name,age,bio,causeofdeath
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure
5,2016-01-01,Mike Oxley,71,"American politician, member of the United Stat...",lung cancer
6,2016-01-01,John Coleman Moore,92,American mathematician.,NaN
...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN

In [24]:
DF [DF['name']== 'Mark B']

  dateofdeath    name age                               bio causeofdeath
8  2016-01-01  Mark B  45  British hip-hop record producer.          NaN

In [25]:
pd.unique(DF['age'])

array(['71', '74', '79', '45', '83', '92', '99', '58', '75', '80', '82',
       '85', '89', '90', '93', '96', '87', '91', '38', '56', '22', '62',
       '84', '51', '33', '37', '69', '86', '97', '67', '95', '70', '63',
       '81', '54', '73', '66', '76', '88', '28', '31', '102', '68', '77',
       '94', '64', '32', '59', '47', '100', '23', ' 8889', '65', '72',
       '60', '48', '57', '78', '26', '61', '103', '98', '25', '20', '101',
       '40', '44', '14', '53', '112', '43', '21', '55', '16', '15', '52',
       nan, '34', '49', '50', '35', '11', '24', '41', ' 4445', '12', '30',
       '42', ' 5253', '39', '107', ' 6869', '46', ' 3031', '36', '104',
       ' 6768', ' 6364', '27', '29', ' 5759', ' 9293', '19', ' 3435',
       ' 7677', ' 2526', ' 68-69', ' 7980', ' 9192', '110', ' 2930', '17',
       ' 8081', ' 9394', '116', ' 7374', ' c. 48', '9', '113', ' 51-52',
       ' c._180', '109', ' 4243', '106', ' 61/62', ' 6667', ' 77/78',
       ' 38/39', ' 8485', ' 6970', ' 50s', ' 59-60', '18', ' 56 or 57',
       '7', ' 7778', ' 8182', '105', '108'], dtype=object)

In [26]:
DF.nunique()

dateofdeath      364
name            6526
age              138
bio             5886
causeofdeath     361
dtype: int64

In [27]:
DF.index

RangeIndex(start=0, stop=6543, step=1)

In [29]:
DF2 = DF.copy()

In [31]:
DF2['age'] = pd.to_numeric(DF['age'], errors = 'coerce')
pd.unique(DF2['age'])

array([7.100e+01, 7.400e+01, 7.900e+01, 4.500e+01, 8.300e+01, 9.200e+01,
       9.900e+01, 5.800e+01, 7.500e+01, 8.000e+01, 8.200e+01, 8.500e+01,
       8.900e+01, 9.000e+01, 9.300e+01, 9.600e+01, 8.700e+01, 9.100e+01,
       3.800e+01, 5.600e+01, 2.200e+01, 6.200e+01, 8.400e+01, 5.100e+01,
       3.300e+01, 3.700e+01, 6.900e+01, 8.600e+01, 9.700e+01, 6.700e+01,
       9.500e+01, 7.000e+01, 6.300e+01, 8.100e+01, 5.400e+01, 7.300e+01,
       6.600e+01, 7.600e+01, 8.800e+01, 2.800e+01, 3.100e+01, 1.020e+02,
       6.800e+01, 7.700e+01, 9.400e+01, 6.400e+01, 3.200e+01, 5.900e+01,
       4.700e+01, 1.000e+02, 2.300e+01, 8.889e+03, 6.500e+01, 7.200e+01,
       6.000e+01, 4.800e+01, 5.700e+01, 7.800e+01, 2.600e+01, 6.100e+01,
       1.030e+02, 9.800e+01, 2.500e+01, 2.000e+01, 1.010e+02, 4.000e+01,
       4.400e+01, 1.400e+01, 5.300e+01, 1.120e+02, 4.300e+01, 2.100e+01,
       5.500e+01, 1.600e+01, 1.500e+01, 5.200e+01,       nan, 3.400e+01,
       4.900e+01, 5.000e+01, 3.500e+01, 1.100e+01, 2.400e+01, 4.100e+01,
       4.445e+03, 1.200e+01, 3.000e+01, 4.200e+01, 5.253e+03, 3.900e+01,
       1.070e+02, 6.869e+03, 4.600e+01, 3.031e+03, 3.600e+01, 1.040e+02,
       6.768e+03, 6.364e+03, 2.700e+01, 2.900e+01, 5.759e+03, 9.293e+03,
       1.900e+01, 3.435e+03, 7.677e+03, 2.526e+03, 7.980e+03, 9.192e+03,
       1.100e+02, 2.930e+03, 1.700e+01, 8.081e+03, 9.394e+03, 1.160e+02,
       7.374e+03, 9.000e+00, 1.130e+02, 1.090e+02, 4.243e+03, 1.060e+02,
       6.667e+03, 8.485e+03, 6.970e+03, 1.800e+01, 7.000e+00, 7.778e+03,
       8.182e+03, 1.050e+02, 1.080e+02])

In [33]:
DF2.nlargest(10, columns=['age'])

,dateofdeath,name,age,bio,causeofdeath
2595,2016-05-11,Abdul Baqi Jammoh,9394.0,"Jordanian politician, Senator (19972001)",NaN
1807,2016-03-29,Zafar Mahmud,9293.0,Indian pilot.,NaN
2408,2016-05-01,Hamzat Ahmadu,9192.0,"Nigerian diplomat, Ambassador to the Soviet Un...",NaN
149,2016-01-07,Patrick Connolly,8889.0,"Irish lawyer, Attorney General (1982)",NaN
4642,2016-09-07,Farhang Sharif,8485.0,Iranian musician and tar player.,NaN
5698,2016-11-11,Turki II bin Abdulaziz Al Saud,8182.0,Saudi Arabian prince and politician.,NaN
2594,2016-05-11,Majid al-Shibl,8081.0,Saudi Arabian announcer.,NaN
2198,2016-04-18,Marwan Dudin,7980.0,"Jordanian politician, Minister of Agriculture ...",NaN
5697,2016-11-11,Muhammad Surur,7778.0,Syrian religious leader.,NaN
2014,2016-04-08,Nicola Abu Raed,7677.0,Lebanese actor and director.,NaN

In [34]:
DF.size

32715

#### -----------------------------

In [70]:
DF = pd.read_csv('celebrity_deaths_2016.csv')
# Average number of celebrities who died between February and July 2019

In [71]:
DF

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5,Unnamed: 6
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer,NaN,NaN
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer,NaN,NaN
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer,NaN,NaN
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke,NaN,NaN
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure,NaN,NaN
...,...,...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN,NaN,NaN
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN,NaN,NaN
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN,NaN,NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized,NaN,NaN
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN,NaN,NaN

In [72]:
DF['Unnamed: 6'].unique()

array([nan, ' '], dtype=object)

In [73]:
DF.drop(['Unnamed: 6'], axis = 1, inplace=True)

In [74]:
DF

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer,NaN
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer,NaN
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer,NaN
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke,NaN
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure,NaN
...,...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN,NaN
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN,NaN
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN,NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized,NaN
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN,NaN

In [75]:
DF['Unnamed: 5'].unique()

array([nan, ' neuroendocrine carcinoma.'], dtype=object)

In [76]:
DF[DF['Unnamed: 5'] == ' neuroendocrine carcinoma.']

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5
6461,2016-12-25,Alphonse Mouzon,68,American jazz drummer (Weather Report,The Eleventh House) and record label owner,neuroendocrine carcinoma.

In [77]:
DF.iloc[6461,3] = DF.iloc[6461,3] + DF.iloc[6461,4]
DF.iloc[6461,4] = DF.iloc[6461,5]

In [78]:
DF[DF['Unnamed: 5'] == ' neuroendocrine carcinoma.']

,dateofdeath,name,age,bio,causeofdeath,Unnamed: 5
6461,2016-12-25,Alphonse Mouzon,68,American jazz drummer (Weather Report The Ele...,neuroendocrine carcinoma.,neuroendocrine carcinoma.

In [79]:
DF.drop(['Unnamed: 5'], axis = 1, inplace=True)

In [80]:
DF['causeofdeath'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6538     True
6539     True
6540     True
6541    False
6542     True
Name: causeofdeath, Length: 6543, dtype: bool

In [85]:
X = DF['causeofdeath'].unique()
# X.sort(axis=0)
print(X.shape)

(362,)

In [89]:
Y = DF['causeofdeath'].value_counts()
Y

causeofdeath
 cancer                                                248
 heart attack                                          125
 traffic collision                                      56
 lung cancer                                            51
 pneumonia                                              50
                                                      ...
 complications from accident                             1
 septic shock                                            1
 grenade explosion                                       1
 complications from esophageal cancer and pneumonia      1
euthanized                                               1
Name: count, Length: 361, dtype: int64

In [90]:
DF['causeofdeath'] = DF['causeofdeath'].str.strip()

In [91]:
Y = DF['causeofdeath'].value_counts()
Y

causeofdeath
cancer                         257
heart attack                   135
traffic collision               57
lung cancer                     52
pneumonia                       51
                              ...
plasma cell leukemia             1
non-Hodgkin lymphoma             1
complications from accident      1
septic shock                     1
euthanized                       1
Name: count, Length: 326, dtype: int64

In [ ]:
X = DF['causeofdeath'].unique()
X.sort(axis=0)
X

In [87]:
A = ['anthropologist and ethnologist', 'anti-smoking campaigner', 'Bharatiya Janta Party leader','Birmingham City)', 'Bordertown)', 'Boston Braves)','Carlisle United)', 'Celtic)','Dutch-born Indonesian Roman Catholic prelate, Bishop of Amboina (19651994)', "Environment and National Service minister and MP for St Ann's East", 'Bharatiya Janta Party leader', 'Myself and I)', 'Star Trek)', 'Tony winner (1970)','choreographer and instructor']
A

['anthropologist and ethnologist',
 'anti-smoking campaigner',
 'Bharatiya Janta Party leader',
 'Birmingham City)',
 'Bordertown)',
 'Boston Braves)',
 'Carlisle United)',
 'Celtic)',
 'Dutch-born Indonesian Roman Catholic prelate, Bishop of Amboina (19651994)',
 "Environment and National Service minister and MP for St Ann's East",
 'Bharatiya Janta Party leader',
 'Myself and I)',
 'Star Trek)',
 'Tony winner (1970)',
 'choreographer and instructor']

In [92]:
X = DF[ DF['causeofdeath'].isin(A)].index
X

Index([ 441,  463, 1530, 1739, 3096, 4071, 4592, 4755, 5081, 5504, 5751, 5937,
       6045, 6073],
      dtype='int64')

In [93]:
DF.iloc[X,:]

,dateofdeath,name,age,bio,causeofdeath
441,2016-01-21,Mrinalini Sarabhai,97,Indian classical dancer,choreographer and instructor
463,2016-01-22,John Dowie,60,Scottish footballer (Fulham,Celtic)
1530,2016-03-15,Lincoln Myers,66,Trinidadian politician,Environment and National Service minister and ...
1739,2016-03-26,Andreas Peter Cornelius Sol,100,Dutch-born Indonesian Roman Catholic prelate,"Dutch-born Indonesian Roman Catholic prelate, ..."
3096,2016-06-10,Alex Govan,86,"Scottish footballer (Plymouth Argyle, Birmingh...",Birmingham City)
4071,2016-08-05,Joe Davis,75,Scottish footballer (Hibernian,Carlisle United)
4592,2016-09-05,Arif Beg,81,"Indian politician, Bharatiya Janta Party leader",Bharatiya Janta Party leader
4755,2016-09-16,Hagan Beggs,79,Northern Irish-born Canadian actor (Danger Bay,Bordertown)
5081,2016-10-05,Georges Balandier,95,French sociologist,anthropologist and ethnologist
5504,2016-10-30,Don Marshall,80,American actor (Land of the Giants,Star Trek)
5751,2016-11-15,Bob Addis,91,American baseball player (Chicago Cubs,Boston Braves)
5937,2016-11-26,Fritz Weaver,90,"American actor (Fail Safe, Holocaust, The Thom...",Tony winner (1970)
6045,2016-12-01,Don Calfa,76,American actor (The Return of the Living Dead;...,Myself and I)
6073,2016-12-03,Sir David Hay,88,New Zealand cardiologist,anti-smoking campaigner

In [94]:
DF['bio'][X] = DF['bio'][X] + " " + DF['causeofdeath'][X]
DF.iloc[X,:]

/var/folders/f3/_st5g9tj5bs69f2k8ttz8mwh0000gn/T/ipykernel_99847/1266251826.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  DF['bio'][X] = DF['bio'][X] + " " + DF['causeofdeath'][X]

,dateofdeath,name,age,bio,causeofdeath
441,2016-01-21,Mrinalini Sarabhai,97,Indian classical dancer choreographer and inst...,choreographer and instructor
463,2016-01-22,John Dowie,60,Scottish footballer (Fulham Celtic),Celtic)
1530,2016-03-15,Lincoln Myers,66,Trinidadian politician Environment and Nationa...,Environment and National Service minister and ...
1739,2016-03-26,Andreas Peter Cornelius Sol,100,Dutch-born Indonesian Roman Catholic prelate D...,"Dutch-born Indonesian Roman Catholic prelate, ..."
3096,2016-06-10,Alex Govan,86,"Scottish footballer (Plymouth Argyle, Birmingh...",Birmingham City)
4071,2016-08-05,Joe Davis,75,Scottish footballer (Hibernian Carlisle United),Carlisle United)
4592,2016-09-05,Arif Beg,81,"Indian politician, Bharatiya Janta Party leade...",Bharatiya Janta Party leader
4755,2016-09-16,Hagan Beggs,79,Northern Irish-born Canadian actor (Danger Bay...,Bordertown)
5081,2016-10-05,Georges Balandier,95,French sociologist anthropologist and ethnologist,anthropologist and ethnologist
5504,2016-10-30,Don Marshall,80,American actor (Land of the Giants Star Trek),Star Trek)
5751,2016-11-15,Bob Addis,91,American baseball player (Chicago Cubs Boston ...,Boston Braves)
5937,2016-11-26,Fritz Weaver,90,"American actor (Fail Safe, Holocaust, The Thom...",Tony winner (1970)
6045,2016-12-01,Don Calfa,76,American actor (The Return of the Living Dead;...,Myself and I)
6073,2016-12-03,Sir David Hay,88,New Zealand cardiologist anti-smoking campaigner,anti-smoking campaigner

In [95]:
DF['causeofdeath'][X] = 'unknown'

/var/folders/f3/_st5g9tj5bs69f2k8ttz8mwh0000gn/T/ipykernel_99847/434743244.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  DF['causeofdeath'][X] = 'unknown'

In [96]:
DF['causeofdeath']

0                    brain cancer
1                          cancer
2                          cancer
3       complications of a stroke
4                   heart failure
                  ...
6538                          NaN
6539                          NaN
6540                          NaN
6541                   euthanized
6542                          NaN
Name: causeofdeath, Length: 6543, dtype: object

In [97]:
DF.loc[X,'bio'] = DF['bio'][X]+" " + DF['causeofdeath'][X]
DF.iloc[X,:]

,dateofdeath,name,age,bio,causeofdeath
441,2016-01-21,Mrinalini Sarabhai,97,Indian classical dancer choreographer and inst...,unknown
463,2016-01-22,John Dowie,60,Scottish footballer (Fulham Celtic) unknown,unknown
1530,2016-03-15,Lincoln Myers,66,Trinidadian politician Environment and Nationa...,unknown
1739,2016-03-26,Andreas Peter Cornelius Sol,100,Dutch-born Indonesian Roman Catholic prelate D...,unknown
3096,2016-06-10,Alex Govan,86,"Scottish footballer (Plymouth Argyle, Birmingh...",unknown
4071,2016-08-05,Joe Davis,75,Scottish footballer (Hibernian Carlisle United...,unknown
4592,2016-09-05,Arif Beg,81,"Indian politician, Bharatiya Janta Party leade...",unknown
4755,2016-09-16,Hagan Beggs,79,Northern Irish-born Canadian actor (Danger Bay...,unknown
5081,2016-10-05,Georges Balandier,95,French sociologist anthropologist and ethnolog...,unknown
5504,2016-10-30,Don Marshall,80,American actor (Land of the Giants Star Trek) ...,unknown
5751,2016-11-15,Bob Addis,91,American baseball player (Chicago Cubs Boston ...,unknown
5937,2016-11-26,Fritz Weaver,90,"American actor (Fail Safe, Holocaust, The Thom...",unknown
6045,2016-12-01,Don Calfa,76,American actor (The Return of the Living Dead;...,unknown
6073,2016-12-03,Sir David Hay,88,New Zealand cardiologist anti-smoking campaign...,unknown

In [98]:
DF.loc[X, 'causeofdeath'] = 'unknown'
DF.iloc[X,:]

,dateofdeath,name,age,bio,causeofdeath
441,2016-01-21,Mrinalini Sarabhai,97,Indian classical dancer choreographer and inst...,unknown
463,2016-01-22,John Dowie,60,Scottish footballer (Fulham Celtic) unknown,unknown
1530,2016-03-15,Lincoln Myers,66,Trinidadian politician Environment and Nationa...,unknown
1739,2016-03-26,Andreas Peter Cornelius Sol,100,Dutch-born Indonesian Roman Catholic prelate D...,unknown
3096,2016-06-10,Alex Govan,86,"Scottish footballer (Plymouth Argyle, Birmingh...",unknown
4071,2016-08-05,Joe Davis,75,Scottish footballer (Hibernian Carlisle United...,unknown
4592,2016-09-05,Arif Beg,81,"Indian politician, Bharatiya Janta Party leade...",unknown
4755,2016-09-16,Hagan Beggs,79,Northern Irish-born Canadian actor (Danger Bay...,unknown
5081,2016-10-05,Georges Balandier,95,French sociologist anthropologist and ethnolog...,unknown
5504,2016-10-30,Don Marshall,80,American actor (Land of the Giants Star Trek) ...,unknown
5751,2016-11-15,Bob Addis,91,American baseball player (Chicago Cubs Boston ...,unknown
5937,2016-11-26,Fritz Weaver,90,"American actor (Fail Safe, Holocaust, The Thom...",unknown
6045,2016-12-01,Don Calfa,76,American actor (The Return of the Living Dead;...,unknown
6073,2016-12-03,Sir David Hay,88,New Zealand cardiologist anti-smoking campaign...,unknown

In [99]:
DF2 = DF.copy()

In [100]:
DF['dateofdeath']

0       2016-01-01
1       2016-01-01
2       2016-01-01
3       2016-01-01
4       2016-01-01
           ...
6538    2016-12-27
6539    2016-12-27
6540    2016-12-27
6541    2016-12-27
6542    2016-12-27
Name: dateofdeath, Length: 6543, dtype: object

In [102]:
DF2['month'] = DF2['dateofdeath'].str.split('-')
DF2['month'] = DF2['month'].str.get(1)
DF2['month'] = DF2['month'].astype(int)
DF2['month']

0        1
1        1
2        1
3        1
4        1
        ..
6538    12
6539    12
6540    12
6541    12
6542    12
Name: month, Length: 6543, dtype: int64

In [103]:
DF

,dateofdeath,name,age,bio,causeofdeath
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure
...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN

In [104]:
DF2

,dateofdeath,name,age,bio,causeofdeath,month
0,2016-01-01,Tony Lane,71,American art director (Rolling Stone),brain cancer,1
1,2016-01-01,Gilbert Kaplan,74,American conductor and businessman,cancer,1
2,2016-01-01,Brian Johns,79,"Australian company director, managing director...",cancer,1
3,2016-01-01,Natasha Aguilar,45,"Costa Rican swimmer, silver and bronze medalis...",complications of a stroke,1
4,2016-01-01,Fazu Aliyeva,83,Russian Avar poet and journalist,heart failure,1
...,...,...,...,...,...,...
6538,2016-12-27,Barbara Tarbuck,74,"American actress (General Hospital, Short Circ...",NaN,12
6539,2016-12-27,Hans Tietmeyer,85,"German economist, President of Deutsche Bundes...",NaN,12
6540,2016-12-27,Ratnasiri Wickremanayake,83,"Sri Lankan politician, Prime Minister (2000200...",NaN,12
6541,2016-12-27,Cara Rafaela,23,American racehorse (death announced on this date),euthanized,12
6542,2016-12-27,Balasaheb Vikhe Patil,84,Indian politician.,NaN,12

In [117]:
X = DF2['age'].str.isdigit()
X

0       True
1       True
2       True
3       True
4       True
        ...
6538    True
6539    True
6540    True
6541    True
6542    True
Name: age, Length: 6542, dtype: object

In [118]:
I = X == False
I

0       False
1       False
2       False
3       False
4       False
        ...
6538    False
6539    False
6540    False
6541    False
6542    False
Name: age, Length: 6542, dtype: bool

In [119]:
DF2[I]

,dateofdeath,name,age,bio,causeofdeath,month
149,2016-01-07,Patrick Connolly,8889,"Irish lawyer, Attorney General (1982)",NaN,1
810,2016-02-08,Sikiru Adesina,4445,Nigerian film actor and director.,NaN,2
946,2016-02-15,Abdul Rahman Al-Hanaqtah,5253,"Jordanian politician, member of the House of R...",NaN,2
1043,2016-02-20,Dave Needle,6869,American computer engineer.,NaN,2
1224,2016-02-29,Mumtaz Qadri,3031,Pakistani convicted murderer (Salmaan Taseer),NaN,2
1491,2016-03-12,Richard Fowler,6768,American naturalist and wilderness guide.,NaN,3
1628,2016-03-19,Zeinab Elobeid Yousif,6364,Sudanese aircraft engineer.,NaN,3
1718,2016-03-25,Abu Ali al-Anbari,5759,"Iraqi militant, commander of ISIL",bombing,3
1807,2016-03-29,Zafar Mahmud,9293,Indian pilot.,NaN,3
1892,2016-04-02,Samid Imanov,3435,Azerbaijani (Special Forces).,NaN,4
2014,2016-04-08,Nicola Abu Raed,7677,Lebanese actor and director.,NaN,4
2057,2016-04-11,"Mohsen Gheytaslou,",2526,Iranian soldier (65th Airborne Special Forces ...,NaN,4
2080,2016-04-12,Robbie Brennan,68-69,"Irish musician (Skid Row, Auto Da F, Grand Sl...",NaN,4
2198,2016-04-18,Marwan Dudin,7980,"Jordanian politician, Minister of Agriculture ...",NaN,4
2408,2016-05-01,Hamzat Ahmadu,9192,"Nigerian diplomat, Ambassador to the Soviet Un...",NaN,5
2515,2016-05-06,Abu Waheeb,2930,Iraqi field commander (ISIL) and prison escape...,NaN,5
2594,2016-05-11,Majid al-Shibl,8081,Saudi Arabian announcer.,NaN,5
2595,2016-05-11,Abdul Baqi Jammoh,9394,"Jordanian politician, Senator (19972001)",NaN,5
2661,2016-05-14,Jess Leguina,7374,"Spanish jurist, justice of the Constitutional ...",NaN,5
2772,2016-05-21,Akhtar Mansour,c. 48,"Afghan Islamist, leader of the Taliban (since ...",airstrike,5
3664,2016-07-13,Hafsa Mossi,51-52,"Burundian politician, Minister of Regional Int...",shot,7
3884,2016-07-24,Mangal Bagh,4243,Pakistani militant leader (Lashkar-e-Islam),NaN,7
4176,2016-08-09,Jimmy Levine,61/62,American R&B musician and record producer.,NaN,8
4327,2016-08-19,Peter Blundell Jones,6667,British architect and architectural historian.,NaN,8
4337,2016-08-20,M. K. Wren,77/78,American science fiction writer.,NaN,8
4516,2016-08-30,Abu Mohammad al-Adnani,38/39,Syrian Islamist leader (ISIL in Syria),NaN,8
4642,2016-09-07,Farhang Sharif,8485,Iranian musician and tar player.,NaN,9
4720,2016-09-12,Gerry Haywood,6970,English darts player.,NaN,9
5369,2016-10-21,Janet Patterson,59-60,"Australian costume designer (The Piano, Peter ...",NaN,10
5502,2016-10-29,Raymond Gilmour,56 or 57,"Northern Irish undercover agent, infiltrated I...",NaN,10
5697,2016-11-11,Muhammad Surur,7778,Syrian religious leader.,NaN,11
5698,2016-11-11,Turki II bin Abdulaziz Al Saud,8182,Saudi Arabian prince and politician.,NaN,11
6339,2016-12-16,Beki _kala Erikli,c. 48,Turkish self-help author,NaN,12

In [111]:
DF2.at[5343,'age'] = str(55)
DF2.at[5343,'age']

'55'

In [112]:
DF2 = DF2.drop(index=[3844])

In [113]:
X = DF2['age'].str.isdigit()
X

0       True
1       True
2       True
3       True
4       True
        ...
6538    True
6539    True
6540    True
6541    True
6542    True
Name: age, Length: 6542, dtype: object

In [120]:
DF2[I]

,dateofdeath,name,age,bio,causeofdeath,month
149,2016-01-07,Patrick Connolly,8889,"Irish lawyer, Attorney General (1982)",NaN,1
810,2016-02-08,Sikiru Adesina,4445,Nigerian film actor and director.,NaN,2
946,2016-02-15,Abdul Rahman Al-Hanaqtah,5253,"Jordanian politician, member of the House of R...",NaN,2
1043,2016-02-20,Dave Needle,6869,American computer engineer.,NaN,2
1224,2016-02-29,Mumtaz Qadri,3031,Pakistani convicted murderer (Salmaan Taseer),NaN,2
1491,2016-03-12,Richard Fowler,6768,American naturalist and wilderness guide.,NaN,3
1628,2016-03-19,Zeinab Elobeid Yousif,6364,Sudanese aircraft engineer.,NaN,3
1718,2016-03-25,Abu Ali al-Anbari,5759,"Iraqi militant, commander of ISIL",bombing,3
1807,2016-03-29,Zafar Mahmud,9293,Indian pilot.,NaN,3
1892,2016-04-02,Samid Imanov,3435,Azerbaijani (Special Forces).,NaN,4
2014,2016-04-08,Nicola Abu Raed,7677,Lebanese actor and director.,NaN,4
2057,2016-04-11,"Mohsen Gheytaslou,",2526,Iranian soldier (65th Airborne Special Forces ...,NaN,4
2080,2016-04-12,Robbie Brennan,68-69,"Irish musician (Skid Row, Auto Da F, Grand Sl...",NaN,4
2198,2016-04-18,Marwan Dudin,7980,"Jordanian politician, Minister of Agriculture ...",NaN,4
2408,2016-05-01,Hamzat Ahmadu,9192,"Nigerian diplomat, Ambassador to the Soviet Un...",NaN,5
2515,2016-05-06,Abu Waheeb,2930,Iraqi field commander (ISIL) and prison escape...,NaN,5
2594,2016-05-11,Majid al-Shibl,8081,Saudi Arabian announcer.,NaN,5
2595,2016-05-11,Abdul Baqi Jammoh,9394,"Jordanian politician, Senator (19972001)",NaN,5
2661,2016-05-14,Jess Leguina,7374,"Spanish jurist, justice of the Constitutional ...",NaN,5
2772,2016-05-21,Akhtar Mansour,c. 48,"Afghan Islamist, leader of the Taliban (since ...",airstrike,5
3664,2016-07-13,Hafsa Mossi,51-52,"Burundian politician, Minister of Regional Int...",shot,7
3884,2016-07-24,Mangal Bagh,4243,Pakistani militant leader (Lashkar-e-Islam),NaN,7
4176,2016-08-09,Jimmy Levine,61/62,American R&B musician and record producer.,NaN,8
4327,2016-08-19,Peter Blundell Jones,6667,British architect and architectural historian.,NaN,8
4337,2016-08-20,M. K. Wren,77/78,American science fiction writer.,NaN,8
4516,2016-08-30,Abu Mohammad al-Adnani,38/39,Syrian Islamist leader (ISIL in Syria),NaN,8
4642,2016-09-07,Farhang Sharif,8485,Iranian musician and tar player.,NaN,9
4720,2016-09-12,Gerry Haywood,6970,English darts player.,NaN,9
5369,2016-10-21,Janet Patterson,59-60,"Australian costume designer (The Piano, Peter ...",NaN,10
5502,2016-10-29,Raymond Gilmour,56 or 57,"Northern Irish undercover agent, infiltrated I...",NaN,10
5697,2016-11-11,Muhammad Surur,7778,Syrian religious leader.,NaN,11
5698,2016-11-11,Turki II bin Abdulaziz Al Saud,8182,Saudi Arabian prince and politician.,NaN,11
6339,2016-12-16,Beki _kala Erikli,c. 48,Turkish self-help author,NaN,12

In [121]:
DF2.loc[I, 'age'] = DF2.loc[I, 'age'].apply(lambda s: s[-2:])

In [122]:
DF2[I]

,dateofdeath,name,age,bio,causeofdeath,month
149,2016-01-07,Patrick Connolly,89,"Irish lawyer, Attorney General (1982)",NaN,1
810,2016-02-08,Sikiru Adesina,45,Nigerian film actor and director.,NaN,2
946,2016-02-15,Abdul Rahman Al-Hanaqtah,53,"Jordanian politician, member of the House of R...",NaN,2
1043,2016-02-20,Dave Needle,69,American computer engineer.,NaN,2
1224,2016-02-29,Mumtaz Qadri,31,Pakistani convicted murderer (Salmaan Taseer),NaN,2
1491,2016-03-12,Richard Fowler,68,American naturalist and wilderness guide.,NaN,3
1628,2016-03-19,Zeinab Elobeid Yousif,64,Sudanese aircraft engineer.,NaN,3
1718,2016-03-25,Abu Ali al-Anbari,59,"Iraqi militant, commander of ISIL",bombing,3
1807,2016-03-29,Zafar Mahmud,93,Indian pilot.,NaN,3
1892,2016-04-02,Samid Imanov,35,Azerbaijani (Special Forces).,NaN,4
2014,2016-04-08,Nicola Abu Raed,77,Lebanese actor and director.,NaN,4
2057,2016-04-11,"Mohsen Gheytaslou,",26,Iranian soldier (65th Airborne Special Forces ...,NaN,4
2080,2016-04-12,Robbie Brennan,69,"Irish musician (Skid Row, Auto Da F, Grand Sl...",NaN,4
2198,2016-04-18,Marwan Dudin,80,"Jordanian politician, Minister of Agriculture ...",NaN,4
2408,2016-05-01,Hamzat Ahmadu,92,"Nigerian diplomat, Ambassador to the Soviet Un...",NaN,5
2515,2016-05-06,Abu Waheeb,30,Iraqi field commander (ISIL) and prison escape...,NaN,5
2594,2016-05-11,Majid al-Shibl,81,Saudi Arabian announcer.,NaN,5
2595,2016-05-11,Abdul Baqi Jammoh,94,"Jordanian politician, Senator (19972001)",NaN,5
2661,2016-05-14,Jess Leguina,74,"Spanish jurist, justice of the Constitutional ...",NaN,5
2772,2016-05-21,Akhtar Mansour,48,"Afghan Islamist, leader of the Taliban (since ...",airstrike,5
3664,2016-07-13,Hafsa Mossi,52,"Burundian politician, Minister of Regional Int...",shot,7
3884,2016-07-24,Mangal Bagh,43,Pakistani militant leader (Lashkar-e-Islam),NaN,7
4176,2016-08-09,Jimmy Levine,62,American R&B musician and record producer.,NaN,8
4327,2016-08-19,Peter Blundell Jones,67,British architect and architectural historian.,NaN,8
4337,2016-08-20,M. K. Wren,78,American science fiction writer.,NaN,8
4516,2016-08-30,Abu Mohammad al-Adnani,39,Syrian Islamist leader (ISIL in Syria),NaN,8
4642,2016-09-07,Farhang Sharif,85,Iranian musician and tar player.,NaN,9
4720,2016-09-12,Gerry Haywood,70,English darts player.,NaN,9
5369,2016-10-21,Janet Patterson,60,"Australian costume designer (The Piano, Peter ...",NaN,10
5502,2016-10-29,Raymond Gilmour,57,"Northern Irish undercover agent, infiltrated I...",NaN,10
5697,2016-11-11,Muhammad Surur,78,Syrian religious leader.,NaN,11
5698,2016-11-11,Turki II bin Abdulaziz Al Saud,82,Saudi Arabian prince and politician.,NaN,11
6339,2016-12-16,Beki _kala Erikli,48,Turkish self-help author,NaN,12

In [123]:
DF2.loc[I,'age'].str.isdigit().all()

True

In [125]:
print(DF2['age'].unique())

['71' '74' '79' '45' '83' '92' '99' '58' '75' '80' '82' '85' '89' '90'
 '93' '96' '87' '91' '38' '56' '22' '62' '84' '51' '33' '37' '69' '86'
 '97' '67' '95' '70' '63' '81' '54' '73' '66' '76' '88' '28' '31' '102'
 '68' '77' '94' '64' '32' '59' '47' '100' '23' '65' '72' '60' '48' '57'
 '78' '26' '61' '103' '98' '25' '20' '101' '40' '44' '14' '53' '112' '43'
 '21' '55' '16' '15' '52' nan '34' '49' '50' '35' '11' '24' '41' '12' '30'
 '42' '39' '107' '46' '36' '104' '27' '29' '19' '110' '17' '116' '9' '113'
 '109' '106' '18' '7' '105' '108']

In [130]:
ind = DF2['age'].isnull()
ind

0       False
1       False
2       False
3       False
4       False
        ...
6538    False
6539    False
6540    False
6541    False
6542    False
Name: age, Length: 6542, dtype: bool

In [129]:
ind.all()

False

In [131]:
ind = ind[ind == True]
ind

496     True
553     True
648     True
827     True
947     True
1350    True
1738    True
1898    True
1959    True
2058    True
2251    True
2580    True
2715    True
2802    True
3239    True
3320    True
3574    True
3634    True
4457    True
4954    True
5094    True
5108    True
5288    True
5699    True
6008    True
6391    True
6430    True
Name: age, dtype: bool

In [132]:
DF2 = DF2.drop(ind.index)

In [133]:
print(DF2['age'].unique())

['71' '74' '79' '45' '83' '92' '99' '58' '75' '80' '82' '85' '89' '90'
 '93' '96' '87' '91' '38' '56' '22' '62' '84' '51' '33' '37' '69' '86'
 '97' '67' '95' '70' '63' '81' '54' '73' '66' '76' '88' '28' '31' '102'
 '68' '77' '94' '64' '32' '59' '47' '100' '23' '65' '72' '60' '48' '57'
 '78' '26' '61' '103' '98' '25' '20' '101' '40' '44' '14' '53' '112' '43'
 '21' '55' '16' '15' '52' '34' '49' '50' '35' '11' '24' '41' '12' '30'
 '42' '39' '107' '46' '36' '104' '27' '29' '19' '110' '17' '116' '9' '113'
 '109' '106' '18' '7' '105' '108']

In [134]:
DF2.loc[:, 'age'].isnull().any()

False

In [135]:
DF2['age'] = pd.to_numeric(DF2['age'], errors='raise')

In [136]:
DF2.describe()

               age        month
count  6515.000000  6515.000000
mean     76.947813     6.239140
std      16.472175     3.489302
min       7.000000     1.000000
25%      69.000000     3.000000
50%      81.000000     6.000000
75%      89.000000     9.000000
max     116.000000    12.000000

In [137]:
I = (DF2['month'] >= 2) & (DF2['month'] <= 7) 
DF2.loc[I, 'age'].describe()

count    3325.000000
mean       77.077293
std        16.374244
min         9.000000
25%        69.000000
50%        81.000000
75%        89.000000
max       116.000000
Name: age, dtype: float64

#### -----------------------------

## Data operators

In [141]:
A = pd.Series([2,4,6], index = [0,1,2])
B = pd.Series([5,7,9], index = [1,2,3])
print(A,'\n\n',B)

0    2
1    4
2    6
dtype: int64

 1    5
2    7
3    9
dtype: int64

In [140]:
A+B

0     NaN
1     9.0
2    13.0
3     NaN
dtype: float64

In [142]:
A.add(B, fill_value = 0)

0     2.0
1     9.0
2    13.0
3     9.0
dtype: float64

In [143]:
rng = np.random.RandomState(24)
A = pd.DataFrame(rng.randint(0,20,(2,2)), columns = list('AB'))
A

   A   B
0  2   3
1  0  17

In [144]:
B = pd.DataFrame(rng.randint(0,10,(3,3)), columns = list('BAC'))
B

   B  A  C
0  1  1  4
1  4  3  2
2  3  3  7

In [149]:
C = A+B
C

     A     B   C
0  3.0   4.0 NaN
1  3.0  21.0 NaN
2  NaN   NaN NaN

In [147]:
print(None, float('nan'),np.nan)

None nan nan

In [152]:
C.notnull()

       A      B      C
0   True   True  False
1   True   True  False
2  False  False  False

In [154]:
C.isnull()

       A      B     C
0  False  False  True
1  False  False  True
2   True   True  True

In [156]:
data = pd.Series([1,np.nan,'hello',None])
data[ data.notnull()]

0        1
2    hello
dtype: object

In [158]:
df = pd.DataFrame([[1, None, 2], [4,5,7], [np.nan, 4, 2]])
df

     0    1  2
0  1.0  NaN  2
1  4.0  5.0  7
2  NaN  4.0  2

In [159]:
df.dropna()

     0    1  2
1  4.0  5.0  7

In [160]:
df.dropna(axis=1)

   2
0  2
1  7
2  2

In [161]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  4.0  5.0  7 NaN
2  NaN  4.0  2 NaN

In [162]:
df.dropna(axis = 'columns', how = 'all')

     0    1  2
0  1.0  NaN  2
1  4.0  5.0  7
2  NaN  4.0  2

In [163]:
df.dropna(axis = 'rows', thresh = 3)

     0    1  2   3
1  4.0  5.0  7 NaN

In [164]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  4.0  5.0  7 NaN
2  NaN  4.0  2 NaN

In [168]:
df.ffill()

     0    1  2   3
0  1.0  NaN  2 NaN
1  4.0  5.0  7 NaN
2  4.0  4.0  2 NaN

In [169]:
df.bfill()

     0    1  2   3
0  1.0  5.0  2 NaN
1  4.0  5.0  7 NaN
2  NaN  4.0  2 NaN

In [170]:
df=pd.DataFrame([[1,np.nan,2,None],[np.nan,5,6,7]], columns = list('ABCD'))
df

     A    B  C    D
0  1.0  NaN  2  NaN
1  NaN  5.0  6  7.0

In [171]:
values = {'A': 1, 'B': 88, 'C':-5, 'D': 99}
df.fillna(value=values)

     A     B  C     D
0  1.0  88.0  2  99.0
1  1.0   5.0  6   7.0

In [172]:
df

     A    B  C    D
0  1.0  NaN  2  NaN
1  NaN  5.0  6  7.0

In [173]:
df.interpolate(axis=1)

     A    B    C    D
0  1.0  1.5  2.0  2.0
1  NaN  5.0  6.0  7.0